[
    {
        "key": "0",
        "url": "https://news.google.com/articles/CBMiemh0dHBzOi8vd3d3Lm5kdHYuY29tL2luZGlhLW5ld3MvcG0tbmFyZW5kcmEtbW9kaS1pbGxpdGVyYXRlLWluZGlhLW5lZWRzLWFuLWVkdWNhdGVkLXByaW1lLW1pbmlzdGVyLWFhbS1hYWRtaS1wYXJ0eS0zOTA2MDE50gGAAWh0dHBzOi8vd3d3Lm5kdHYuY29tL2luZGlhLW5ld3MvcG0tbmFyZW5kcmEtbW9kaS1pbGxpdGVyYXRlLWluZGlhLW5lZWRzLWFuLWVkdWNhdGVkLXByaW1lLW1pbmlzdGVyLWFhbS1hYWRtaS1wYXJ0eS0zOTA2MDE5L2FtcC8x?hl=en-IN&gl=IN&ceid=IN%3Aen",
        "title": "PM Modi \"Illiterate\", India Needs \"An Educated Prime Minister\": Aam Aadmi Party",
        "description": "Aam Aadmi Party targetted PM Modi today, saying India needs \"an educated Prime Minister\"\n\nIndia needs an educated Prime Minister to stop hatred, make policies, and to realise the dreams of its founding fathers, the Aam Aadmi Party or AAP said in Srinagar today.\n\nAddressing a press conference to launch a campaign \"Modi hatao-Desh bachao\", AAP media coordination committee chairman Nawab Nasir Aman said an \"illiterate person cannot run a country.\"\n\n\"He (PM Modi) says he is illiterate. India needs an educated person, to make policies, to stop hatred. Today, we are launching a national campaign 'Modi hatao-Desh bachao',\" he said.\n\nMr Aman said the party will face criticism and can even be jailed for the campaign. \"But that will not stop us from saying this.\"\n\n\"If we have to save the country, if we have to realise the dream of Sardar Vallabhbhai Patel, MK Gandhi, or Jawaharlal Nehru, then Narendra Modi has to go. (Narendra) Modi is misusing agencies such as courts, ED, and ECI for his gains. We have to fight a new fight for freedom. We have to elect an educated Prime Minister,\" he said.\n\n\"Every Muslim, Hindu and Sikh dreamt of getting good education, healthcare, peace. But today, this government issues Enforcement Directorate summons to Chief Ministers from non-BJP parties, raids them, but, when they join BJP, they become clean,\" he said.\n\nMr Aman said the current central government is only working for the prosperity of a few businessmen.\n\n\"If everything is fine in J&K, then why is the election not being conducted here,\" Mr Aman said over the long pending assembly election in the Union Territory.\n\n\n\n(Except for the headline, this story has not been edited by NDTV staff and is published from a syndicated feed.)",
        "summary": "Aam Aadmi Party targetted PM Modi today, saying India needs \"an educated Prime Minister\"India needs an educated Prime Minister to stop hatred, make policies, and to realise the dreams of its founding fathers, the Aam Aadmi Party or AAP said in Srinagar today.\nAddressing a press conference to launch a campaign \"Modi hatao-Desh bachao\", AAP media coordination committee chairman Nawab Nasir Aman said an \"illiterate person cannot run a country.\"\nIndia needs an educated person, to make policies, to stop hatred.\nToday, we are launching a national campaign 'Modi hatao-Desh bachao',\" he said.\nWe have to elect an educated Prime Minister,\" he said.",
        "keywords": [
            "needs",
            "aman",
            "campaign",
            "prime",
            "minister",
            "party",
            "india",
            "aam",
            "saying",
            "aadmi",
            "educated",
            "modi",
            "today",
            "stop",
            "illiterate"
        ],
        "sentiment": [
            "positive",
            1.0
        ],
        "dark": "False"
    },
    {
        "key": "1",
        "url": "https://news.google.com/stories/CAAqNggKIjBDQklTSGpvSmMzUnZjbmt0TXpZd1NoRUtEd2pkMU1MOUJoRk1QMjAwaGI0NlJTZ0FQAQ?hl=en-IN&gl=IN&ceid=IN%3Aen",
        "title": "PM Modi visits new Parliament building in New Delhi",
        "description": "By date\n\nBy relevance",
        "summary": "By dateBy relevance",
        "keywords": [
            "parliament",
            "delhi",
            "building",
            "dateby",
            "modi",
            "visits",
            "relevance"
        ],
        "sentiment": [
            "positive",
            1.0
        ],
        "dark": "False"
    },
    {
        "key": "2",
        "url": "https://news.google.com/articles/CBMi0wFodHRwczovL3plZW5ld3MuaW5kaWEuY29tL2luZGlhL3VuaW9uLWxhdy1taW5pc3Rlci1raXJlbi1yaWppanUtc2F5cy1pbmRpYS11bmRlci1wbS1uYXJlbmRyYS1tb2RpLXdvbnQtdG9sZXJhdGUtZm9yZWlnbi1pbmZsdWVuY2UtYWZ0ZXItZ2VybWFueS10YWtlcy1ub3RlLW9mLXJhaHVsLWdhbmRoaXMtbG9rLXNhYmhhLWRpc3F1YWxpZmljYXRpb24tMjU4OTQwOC5odG1s0gHXAWh0dHBzOi8vemVlbmV3cy5pbmRpYS5jb20vaW5kaWEvdW5pb24tbGF3LW1pbmlzdGVyLWtpcmVuLXJpamlqdS1zYXlzLWluZGlhLXVuZGVyLXBtLW5hcmVuZHJhLW1vZGktd29udC10b2xlcmF0ZS1mb3JlaWduLWluZmx1ZW5jZS1hZnRlci1nZXJtYW55LXRha2VzLW5vdGUtb2YtcmFodWwtZ2FuZGhpcy1sb2stc2FiaGEtZGlzcXVhbGlmaWNhdGlvbi0yNTg5NDA4Lmh0bWwvYW1w?hl=en-IN&gl=IN&ceid=IN%3Aen",
        "title": "Law Minister Says India Under PM Modi Won't Tolerate 'Foreign Influence' After Germany 'Takes Note' Of Rahul's Disqualification",
        "description": "New Delhi: Hours after Germany said that it has 'taken note' of Congress leader Rahul Gandhi's disqualification from Lok Sabha, Union Law Minister Kiren Rijiju on Thursday (March 30, 2023) said that India won't tolerate 'foreign influence'. Sharing a screenshot of senior Congress leader Digvijaya Singh, who thanked the German foreign ministry for 'taking note of how Democracy is being compromised in India through the persecution of Rahul Gandhi', Rijiju on Twitter 'thanked' Rahul Gandhi for 'inviting' foreign powers for interference into India's internal matters.\n\n\"Remember, Indian Judiciary can't be influenced by foreign interference. India won't tolerate 'foreign influence' anymore because our Prime Minister is:- Shri Narendra Modi Ji,\" Rijiju said in a tweet.\n\nThank you Rahul Gandhi for inviting foreign powers for interference into India’s internal matters. Remember, Indian Judiciary can't be influenced by foreign interference. India won't tolerate 'foreign influence' anymore because our Prime Minister is:- Shri @narendramodi Ji pic.twitter.com/xHzGRzOYTz — Kiren Rijiju (@KirenRijiju) March 30, 2023\n\nThe Bharatiya Janata Pary (BJP) leader's reaction came after Digvijaya Singh tagged a tweet by Chief International Editor of Deutsche Welle Richard Walker, in which the senior journalist had posted a video of a German foreign ministry spokesperson reacting to Gandhi's disqualification.\n\nAt a press briefing, Germany's foreign ministry spokesperson said, \"We have taken note of the verdict of first instance against Indian opposition politician Rahul Gandhi as well as the suspension of his parliamentary mandate.\"\n\n\"To our knowledge, Mr Gandhi is in a position to appeal the verdict. It will then become clear whether this verdict will stand and whether the suspension of his mandate has any basis,\" the spokesperson was quoted as saying.\n\nGermany expects that \"standards of judicial independence and fundamental democratic principles\" will equally apply to the proceedings against Rahul Gandhi, the spokesperson added.\n\nThank you Germany Foreign Affairs Ministry and Richard Walker @rbsw for taking note of how the Democracy is being compromised in India through persecution of @RahulGandhi https://t.co/CNy6fPkBi3 — digvijaya singh (@digvijaya_28) March 30, 2023\n\nA host of BJP leaders then attacked the Congress and Singh and accusing the party of \"inviting foreign interference\" in internal affairs.\n\n\"Disgrace to nation, INC & Rahul Gandhi don't believe to fight India's democratic, political and legal battle within country, hence, invite foreign powers to interfere in our internal matter,\" Information and Broadcasting minister Anurag Thakur said.\n\n\"But New India headed by Narendra Modi Ji will not tolerate any foreign intervention,\" he added.\n\nDisgrace to nation, @INCIndia & @RahulGandhi don't believe to fight India's democratic, political & legal battle within country, hence, invite foreign powers to interfere in our internal matter. But New India headed by @narendramodi Ji will not tolerate any foreign intervention. pic.twitter.com/qjL7dRX1JJ — Anurag Thakur (@ianuragthakur) March 30, 2023\n\nFinance Minister Niramala Sitharaman also slammed the Congress over Singh's tweet.\n\n\"Apparent that INC wants foreign interference in our affairs. Sign Memorandum of Understanding (MoU) with Communist Party of China with opaque contents. During interactions abroad, plead for help to change government. Thank them when help forthcoming. Any more proof needed?\" she said.\n\nApparent that @INCIndia wants foreign interference in our affairs.\n\n\n\nSign Memorandum of Understanding (MoU) with Communist Party of China with opaque contents. During interactions abroad, plead for help to change government.\n\nThank them when help forthcoming.\n\nAny more proof needed? https://t.co/aZ4rNuJhxN — Nirmala Sitharaman (@nsitharaman) March 30, 2023\n\nThe BJP and Congress have been attacking each other since Rahul Gandhi was disqualified from Lok Sabha on March 23 after a court in Gujarat's Surat convicted him in a 2019 defamation case.",
        "summary": "New Delhi: Hours after Germany said that it has 'taken note' of Congress leader Rahul Gandhi's disqualification from Lok Sabha, Union Law Minister Kiren Rijiju on Thursday (March 30, 2023) said that India won't tolerate 'foreign influence'.\n\"Remember, Indian Judiciary can't be influenced by foreign interference.\nIndia won't tolerate 'foreign influence' anymore because our Prime Minister is:- Shri Narendra Modi Ji,\" Rijiju said in a tweet.\nRemember, Indian Judiciary can't be influenced by foreign interference.\nGermany expects that \"standards of judicial independence and fundamental democratic principles\" will equally apply to the proceedings against Rahul Gandhi, the spokesperson added.",
        "keywords": [
            "30",
            "interference",
            "note",
            "rahuls",
            "tolerate",
            "minister",
            "india",
            "rahul",
            "takes",
            "wont",
            "law",
            "gandhi",
            "internal",
            "modi",
            "influence",
            "congress",
            "foreign"
        ],
        "sentiment": [
            "positive",
            1.0
        ],
        "dark": "False"
    },
    {
        "key": "3",
        "url": "https://news.google.com/articles/CBMieGh0dHBzOi8vd3d3LmhpbmR1c3RhbnRpbWVzLmNvbS9pbmRpYS1uZXdzL3BtLW1vZGktdG8tam9pbi10b3AtbWlsaXRhcnktbWVldC1mb2N1cy1vbi10aGVhdGVyaXNhdGlvbi0xMDE2ODAyMDAzNTQ2MzQuaHRtbNIBAA?hl=en-IN&gl=IN&ceid=IN%3Aen",
        "title": "PM Modi to join top military meet, focus on theaterisation",
        "description": "A top military conference, which began in Bhopal on Thursday and will be addressed by Prime Minister Narendra Modi on April 1, will bring into sharp focus India’s renewed push for theaterisation for the best use of its military’s resources to fight future wars, the operational readiness of the armed forces in the backdrop of the lingering border row with China, and the progress in achieving self-reliance in the defence manufacturing sector, officials familiar with the matter said. Prime Minister Narendra Modi. (ANI/PIB)\n\nRead here: PM Modi reviews new parliament construction during surprise visit\n\nThe three-day Combined Commanders’ Conference is based on the theme Ready, Resurgent, Relevant.\n\n“During the conference, deliberations will be held over a varied spectrum of issues pertaining to national security, including jointness and theaterisation in the armed forces,” the PMO said in a statement. “Preparation of the armed forces and progress in defence ecosystem towards attaining ‘Aatmanirbharta’ (self-reliance) will also be reviewed.”\n\n“Theaterisation, operational readiness of the armed forces and self-reliance are the most important issues for the armed forces at the moment. We can expect forward movement in all these areas as the PM is himself providing the directions to make the armed forces stronger,” said Air Marshal Anil Chopra (retd), director general, Centre for Air Power Studies.\n\nThose taking part in the conference include defence minister Rajnath Singh, the chief of defence staff, the three service chiefs, and top commanders of the armed forces. Personnel below officer rank (PBOR) will also take part in conference.\n\n“Inclusive and informal interaction will also be held with soldiers, sailors and airmen from army, navy and air force who will contribute to the deliberations,” the PMO said. PBOR took part in the Combined Commanders’ Conference for the first time in 2021 when it was held at Kevadia in Gujarat and attended by the PM.\n\nThe conference comes at a time when the government is pushing a bill in Parliament to empower the commanders of tri-services organisations to take action against service personnel of any of the three services -- serving under existing or future joint commands or institutions -- to ensure discipline and effective discharge of duties.\n\nThe existing legal framework of the armed forces has its limitations when it comes to tri-services matters as officers of one particular service lack the authority to exercise disciplinary and administrative powers over personnel belonging to another service. For instance, a three-star general heading a joint command cannot take action against air force or navy personnel serving under him.\n\nMilitary personnel are currently governed by the respective laws of the three services , the Army Act, 1950, the Air Force Act, 1950, and the Navy Act, 1957.\n\nThe Inter-Services Organisations (Command, Control and Discipline) Bill, 2023, also seeks to empower the government to notify the setting up of inter-services organisations, including joint services commands --a key goal of the ongoing theaterisation drive -- comprising units and personnel drawn from the three services, and placed under a commander-in-chief.\n\nEfforts to push theaterisation have gathered steam again after General Anil Chauhan took over as CDS in September 2022; the momentum was hit after his predecessor, General Bipin Rawat, died in a helicopter crash in December 2021.\n\nThe theaterisation model being pursued under General Rawat sought to set up four integrated commands -- two land-centric theatres, an air defence command and a maritime theatre command. This, however, is being reworked on the back of the Indian Air Force’s reservations about the joint structures that were earlier under consideration. The armed forces have 17 single-service commands spread across the country. The army and air force have seven commands each, while the navy has three. Creating theatres would involve merging the existing commands.\n\nRead here: ‘You will conquer the world’: Karnataka farmer kisses PM Modi's pic| Video\n\nThe situation along the Line of Actual Control (LAC) with China is also expected to be discussed during the conference, the officials said.\n\nDespite four rounds of disengagement from Galwan Valley, Pangong Tso, Gogra (PP-17A) and Hot Springs (PP-15), the Indian and Chinese armies still have more than 60,000 troops each and advanced weaponry deployed in the Ladakh theatre. The Indian and Chinese armies have held 17 rounds of talks so far, but problems at Depsang in Daulet Beg Oldi sector and Charding Nullah Junction (CNJ) in Demchok sector are still on the negotiating table. The two sides have been locked in a standoff for almost three years.\n\nOn March 14, India announced the setting up of a top-level panel to fast-track infrastructure projects in areas close to LAC. The projects being executed in forward areas involve several ministries including defence; road transport and highways; environment, forest and climate change; railways and communications, and power and new and renewable energy.\n\nThe secretaries of these ministries will be part of the new committee.\n\nSelf-reliance in defence will figure prominently on the conference’s agenda, the officials said on a day the defence ministry signed contracts worth ₹32,100 crore for buying indigenous military hardware to boost the capabilities of the armed forces.\n\nIndia has earmarked 75% of this year’s defence capital procurement budget for buying weapons and systems from local manufacturers, a move aimed at unlocking new opportunities for achieving self-reliance targets and ramping up the country’s defence exports.\n\nThe share of the domestic sector in the defence budget was never higher. India set aside 68% of the military’s capital acquisition budget for making indigenous purchases in 2022-23, 64% in 2021-22, and 58% in 2020-21. Around ₹1 lakh crore has been set aside for domestic procurement this year, compared to ₹84,598 crore, ₹70,221 crore and ₹51,000 crore in the three previous years.\n\nRead here: Will an Indian spokesperson comment on Germany’s internal issues?\n\nApart from creating a separate budget for buying locally made military hardware, the government has taken a raft of steps to promote self-reliance in the defence manufacturing sector including increasing foreign direct investment (FDI) from 49% to 74%, and notifying hundreds of weapons and systems that cannot be imported.",
        "summary": "“Preparation of the armed forces and progress in defence ecosystem towards attaining ‘Aatmanirbharta’ (self-reliance) will also be reviewed.”“Theaterisation, operational readiness of the armed forces and self-reliance are the most important issues for the armed forces at the moment.\nThose taking part in the conference include defence minister Rajnath Singh, the chief of defence staff, the three service chiefs, and top commanders of the armed forces.\nThe theaterisation model being pursued under General Rawat sought to set up four integrated commands -- two land-centric theatres, an air defence command and a maritime theatre command.\nThis, however, is being reworked on the back of the Indian Air Force’s reservations about the joint structures that were earlier under consideration.\nThe armed forces have 17 single-service commands spread across the country.",
        "keywords": [
            "forces",
            "armed",
            "air",
            "general",
            "focus",
            "theaterisation",
            "sector",
            "defence",
            "meet",
            "conference",
            "personnel",
            "modi",
            "military",
            "selfreliance",
            "join"
        ],
        "sentiment": [
            "positive",
            1.0
        ],
        "dark": "False"
    },
    {
        "key": "4",
        "url": "https://news.google.com/articles/CBMiZ2h0dHBzOi8vd3d3LnRlbGVncmFwaGluZGlhLmNvbS9pbmRpYS9pbmRpYS1pcy10aGUtbW90aGVyLW9mLWRlbW9jcmFjeS1zYXlzLXBtLW5hcmVuZHJhLW1vZGkvY2lkLzE5MjU5ODfSAWtodHRwczovL3d3dy50ZWxlZ3JhcGhpbmRpYS5jb20vYW1wL2luZGlhL2luZGlhLWlzLXRoZS1tb3RoZXItb2YtZGVtb2NyYWN5LXNheXMtcG0tbmFyZW5kcmEtbW9kaS9jaWQvMTkyNTk4Nw?hl=en-IN&gl=IN&ceid=IN%3Aen",
        "title": "India is the mother of democracy, says PM Narendra Modi",
        "description": "'In our ancient epic, the Mahabharata, the first duty of citizens is described as choosing their own leader'\n\nThe Prime Minister’s short speech at US President Joe Biden’s second Summit for Democracy was in sharp contrast to what his friend and beleaguered Israeli Prime Minister Benjamin Netanyahu said.\n\nUnder attack for undermining democracy and its institutions, Prime Minister Narendra Modi on Wednesday reasserted that India is the mother of democracy, tracing its roots to ancient India and asserting that the country’s economic growth was the “best advertisement for democracy”.\n\nWhile Modi made no reference to concerns at home and overseas about India’s “democratic backslide”, Netanyahu took the protests and criticism head-on and billed them as a “robust debate” that has provided Israel a historic opportunity to strengthen democracy.\n\nIn his speech, Modi said: “The idea of elected leaders was a common feature in ancient India, long before the rest of the world. In our ancient epic, the Mahabharata, the first duty of citizens is described as choosing their own leader. Our sacred Vedas speak of political power being exercised by broad-based consultative bodies. There are also many historical references to Republic states in ancient India, where the rulers were not hereditary. India is, indeed, the mother of democracy.”\n\nDemocracy, he added, is not just a structure, \"it is also a spirit” based on the belief that the needs and aspirations of every human being are equally important. He linked this to one of his earliest slogans as Prime Minister — \"Sabka Saath, Sabka Vikas (striving together for inclusive growth)”.\n\n\"There is much to say about the virtues of democracy, but let me say just this: India, despite the many global challenges, is the fastest-growing major economy today. This itself is the best advertisement for democracy in the world. This itself says that democracy can deliver,’’ Modi said.\n\nThe Summit of Democracy was an election promise made by Biden during his campaign when the US itself was fighting an assault on its democracy by his predecessor Donald Trump’s supporters. Biden conceived it as an exercise to renew democracy at home while confronting autocracies abroad, knowing full well that the Trump years had eroded Washington’s right to grandstand on democracy without some introspection.",
        "summary": "Under attack for undermining democracy and its institutions, Prime Minister Narendra Modi on Wednesday reasserted that India is the mother of democracy, tracing its roots to ancient India and asserting that the country’s economic growth was the “best advertisement for democracy”.\nIn his speech, Modi said: “The idea of elected leaders was a common feature in ancient India, long before the rest of the world.\nThere are also many historical references to Republic states in ancient India, where the rulers were not hereditary.\nHe linked this to one of his earliest slogans as Prime Minister — \"Sabka Saath, Sabka Vikas (striving together for inclusive growth)”.\nThe Summit of Democracy was an election promise made by Biden during his campaign when the US itself was fighting an assault on its democracy by his predecessor Donald Trump’s supporters.",
        "keywords": [
            "speech",
            "narendra",
            "prime",
            "minister",
            "india",
            "ancient",
            "mother",
            "world",
            "modi",
            "summit",
            "democracy",
            "say"
        ],
        "sentiment": [
            "positive",
            1.0
        ],
        "dark": "False"
    },
    {
        "key": "5",
        "url": "https://news.google.com/articles/CBMivgFodHRwczovL3d3dy5pbmRpYXR2bmV3cy5jb20va2FybmF0YWthL2thcm5hdGFrYS1mYXJtZXItYnJlYWtzLWRvd24tYWZ0ZXItc2VlaW5nLXBtLW1vZGktcGhvdG8tb24tYnVzLXNob3dlcnMtcHJhaXNlcy13YXRjaC12aXJhbC12aWRlby1rYXJuYXRha2EtYXNzZW1ibHktZWxlY3Rpb25zLTIwMjMtYmpwLTIwMjMtMDMtMzAtODU4OTIw0gHCAWh0dHBzOi8vd3d3LmluZGlhdHZuZXdzLmNvbS9hbXAva2FybmF0YWthL2thcm5hdGFrYS1mYXJtZXItYnJlYWtzLWRvd24tYWZ0ZXItc2VlaW5nLXBtLW1vZGktcGhvdG8tb24tYnVzLXNob3dlcnMtcHJhaXNlcy13YXRjaC12aXJhbC12aWRlby1rYXJuYXRha2EtYXNzZW1ibHktZWxlY3Rpb25zLTIwMjMtYmpwLTIwMjMtMDMtMzAtODU4OTIw?hl=en-IN&gl=IN&ceid=IN%3Aen",
        "title": "Watch: Karnataka farmer breaks down after seeing PM Modi photo on bus, showers praises",
        "description": "Follow us on Image Source : SOCIAL MEDIA Karnataka farmer kissing PM Modi's photo\n\nKarnataka: A video of a farmer from Karnataka showering praises and extending gratitudes to Prime Minister Narendra Modi as well as kissing his picture put on a bus has gone viral. The old man also thanked him for good the governance and said that the Prime Minister will conquer the world.\n\nIt is pertinent to mention that no other leader can today ranks closer to PM Modi in terms of popularity and because of which he is the most popular leaders in the world. The love and affection for the Prime Minister have been growing day by day. Even during her first visit to India, Italian Prime Minister Giorgia Meloni praised PM Modi and said he is the \"most loved leader around the world.\"\n\nPM Modi supporters and fans loves him very much and we have seen many examples of this. Today, one such deep affection for the Prime Minister has surfaced from the coastal state of Karnataka. A video which is widely circulating on social media, a farmer was seen crying after seeing PM Modi’s picture on the bus. According to reports, the old man seen in the viral video is a farmer and makes his living by farming.\n\nAlso Read: Karnataka poll battle 2023: Stage set for BJP Vs Congress Vs JD-S three-cornered fight\n\nPM Modi will conquer the world\n\nIn the video, the farmer can also be seen talking to PM Modi’s photo emotionally and in between he also breaks down. The old man was also seen kissing the picture. The farmer was heard saying in local language that: \"I was getting a Rs 1000, you made me get Rs 500 more. You decided to give Rs 5 lakhs for our health care, you will conquer the world.\"\n\nThe video went viral at a time when the state is all set for the assembly elections in May this year. A picture of PM Modi has been placed on the KSRTC bus as an advertisement for the G20 summit.\n\nAssembly elections in Karnataka\n\nThe state will witness a single phase of voting on May 10, whereas the results will be declared on May 13. Notably, the term of the 224-member Karnataka Assembly will be ending on May 24. Speaking at the press conference, Chief Election Commissioner Rajiv Kumar said that more than 9.17 lakh first-time voters will be participating in the upcoming elections in Karnataka.\n\nAlso Read: Karnataka elections 2023: Over 9.17 lakh first-time voters to exercise their franchise in upcoming polls",
        "summary": "The old man also thanked him for good the governance and said that the Prime Minister will conquer the world.\nThe love and affection for the Prime Minister have been growing day by day.\nToday, one such deep affection for the Prime Minister has surfaced from the coastal state of Karnataka.\nAccording to reports, the old man seen in the viral video is a farmer and makes his living by farming.\nAlso Read: Karnataka elections 2023: Over 9.17 lakh first-time voters to exercise their franchise in upcoming polls",
        "keywords": [
            "watch",
            "bus",
            "prime",
            "picture",
            "seeing",
            "minister",
            "viral",
            "karnataka",
            "showers",
            "seen",
            "modi",
            "video",
            "breaks",
            "praises",
            "elections",
            "farmer"
        ],
        "sentiment": [
            "positive",
            1.0
        ],
        "dark": "False"
    },
    {
        "key": "6",
        "url": "https://news.google.com/stories/CAAqNggKIjBDQklTSGpvSmMzUnZjbmt0TXpZd1NoRUtEd2pJaE5IOUJoR3E5bkwteEt6VFNTZ0FQAQ?hl=en-IN&gl=IN&ceid=IN%3Aen",
        "title": "News about Narendra Modi, Amit Shah",
        "description": "In the last 9 years, India has proved itself in all the fields to the world. The credit for it goes to the citizens, the real heroes, of the country. #ShahAtNews18RisingIndia www.youtube.com/watch?v=0NdfOJHiCJU",
        "summary": "In the last 9 years, India has proved itself in all the fields to the world.\nThe credit for it goes to the citizens, the real heroes, of the country.\n#ShahAtNews18RisingIndia www.youtube.com/watch?v=0NdfOJHiCJU",
        "keywords": [
            "goes",
            "narendra",
            "amit",
            "shah",
            "wwwyoutubecomwatchv0ndfojhicju",
            "india",
            "world",
            "shahatnews18risingindia",
            "proved",
            "modi",
            "fields",
            "credit",
            "real",
            "heroes"
        ],
        "sentiment": [
            "positive",
            1.0
        ],
        "dark": "False"
    },
    {
        "key": "7",
        "url": "https://news.google.com/articles/CBMipQFodHRwczovL3d3dy5saXZlbWludC5jb20vbmV3cy93b3JsZC9pbmRpYS1mYXN0ZXN0LWdyb3dpbmctbWFqb3ItZWNvbm9teS1kZXNwaXRlLWdsb2JhbC1jaGFsbGVuZ2VzLXNheXMtcG0tbW9kaS1hdC1kZW1vY3JhY3ktc3VtbWl0LXdpdGgtam9lLWJpZGVuLTExNjgwMDg1NzQxNzI4Lmh0bWzSAakBaHR0cHM6Ly93d3cubGl2ZW1pbnQuY29tL25ld3Mvd29ybGQvaW5kaWEtZmFzdGVzdC1ncm93aW5nLW1ham9yLWVjb25vbXktZGVzcGl0ZS1nbG9iYWwtY2hhbGxlbmdlcy1zYXlzLXBtLW1vZGktYXQtZGVtb2NyYWN5LXN1bW1pdC13aXRoLWpvZS1iaWRlbi9hbXAtMTE2ODAwODU3NDE3MjguaHRtbA?hl=en-IN&gl=IN&ceid=IN%3Aen",
        "title": "‘India fastest-growing major economy despite global challenges’, says PM Modi at summit with Biden",
        "description": "India's Prime Minister Narendra Modi on Wednesday hailed India as the mother of democracy and said that the country had become the fastest growing major economy despite many global challenges. The Prime Minister was speaking at the Democracy Summit he was co-hosting with United States President Joe Biden.\n\nPM Modi also said that India's growing stance on economy was a proof of the fact that the democracy can deliver.\n\n\"India, despite the many global challenges, is the fastest growing major economy today. This itself is the best advertisement for the democracy and the world. This itself says that democracy can deliver,\" he said.\n\nIn a virtual address to the Summit for Democracy, 2023, Modi also said that every initiative of his government is powered by collective efforts of the citizens of India.\n\nModi was speaking at the second Summit for Democracy, co-hosted by US President Joe Biden, Costa Rica President Rodrigo Chaves Robles, Zambia President Hakainde Hichilema, the Netherlands Prime Minister Mark Rutte and South Korea President Yoon Suk Yeol.\n\nSpeaking during the 'Leader-level Plenary on Democracy Delivering Economic Growth and Shared Prosperity' session hosted by President Yoon, he said the idea of elected leaders was a common feature in ancient India long before the rest of the world.\n\n\"Our epic Mahabharata describes the first duty of citizens as choosing their own leader. Our sacred vedas speak of political power being exercised by broad-based consultative bodies. There are also many historical evidences of republic states in ancient India where rulers were not hereditary,\" Modi said.\n\n\"India indeed is the mother of democracy. Democracy is not just a structure, it is also a spirit. It is based on the belief that the needs and aspirations of every human being are equally important. That is why in India, our guiding philosophy is 'Sabka saath, sabka vikas', meaning striving together for inclusive growth,\" he said.\n\n\"Whether it is our effort to fight climate change through lifestyle changes, to conserve water through distributed storage or provide clean cooking fuel to everyone, every initiative is powered by collective efforts of citizens of India. During Covid-19, India's response was people-driven,\" the prime minister added.\n\nModi said the country's 'vaccine maitri' initative was also guided by the mantra' of 'vasudeva kutumbakam', meaning 'one earth, one family and one future'.",
        "summary": "India's Prime Minister Narendra Modi on Wednesday hailed India as the mother of democracy and said that the country had become the fastest growing major economy despite many global challenges.\nThe Prime Minister was speaking at the Democracy Summit he was co-hosting with United States President Joe Biden.\nPM Modi also said that India's growing stance on economy was a proof of the fact that the democracy can deliver.\n\"India, despite the many global challenges, is the fastest growing major economy today.\nDuring Covid-19, India's response was people-driven,\" the prime minister added.",
        "keywords": [
            "indias",
            "economy",
            "prime",
            "growing",
            "despite",
            "minister",
            "india",
            "fastestgrowing",
            "biden",
            "global",
            "major",
            "modi",
            "challenges",
            "summit",
            "president",
            "democracy"
        ],
        "sentiment": [
            "positive",
            1.0
        ],
        "dark": "False"
    },
    {
        "key": "8",
        "url": "https://news.google.com/articles/CBMiaWh0dHBzOi8vc3dhcmFqeWFtYWcuY29tL3RlY2gvbnhwLWNlby1tZWV0cy1wbS1tb2RpLWRpc2N1c3Nlcy1zdHJlbmd0aGVuaW5nLWluZGlhcy1zZW1pY29uZHVjdG9yLWVjb3N5c3RlbdIBdWh0dHBzOi8vc3dhcmFqeWFtYWcuY29tL2FtcC9zdG9yeS90ZWNoJTJGbnhwLWNlby1tZWV0cy1wbS1tb2RpLWRpc2N1c3Nlcy1zdHJlbmd0aGVuaW5nLWluZGlhcy1zZW1pY29uZHVjdG9yLWVjb3N5c3RlbQ?hl=en-IN&gl=IN&ceid=IN%3Aen",
        "title": "NXP CEO Meets PM Modi, Discusses Strengthening India's Semiconductor Ecosystem",
        "description": "Prime Minister Narendra Modi on Thursday (30 March) met NXP’s CEO Kurt Sievers and discussed the transformative landscape in the world of semiconductors and innovation.\n\nThe meeting took place earlier this week with NXP tweeting Tuesday that its CEO Sievers met Prime Minister Modi to discuss strengthening the semiconductor ecosystem, developing STEM workforce and startup ecosystem in India. \"\n\nWe're committed to driving innovation and positive change through our tech solutions,\" the firm said.\n\nTagging the tweet by NXP, PM Modi said on Twitter, \"Happy to have met Mr. Kurt Sievers, the CEO of @NXP and discuss the transformative landscape in the world of semiconductors and innovation.\"\n\nIndia is emerging as a key force in these sectors, powered by our talented youth, the Prime Minister said.\n\nPM Modi's meeting with NXP CEO gains significance as India is trying to develop its own semiconductor manufacturing ecosystem.\n\nNXP Semiconductors is a Dutch semiconductor designer and manufacturer.\n\nThe company provides technology solutions targeting the automotive, industrial and IoT, mobile, and communication infrastructure markets. The company owns over 9,500 patent families.",
        "summary": "Prime Minister Narendra Modi on Thursday (30 March) met NXP’s CEO Kurt Sievers and discussed the transformative landscape in the world of semiconductors and innovation.\nThe meeting took place earlier this week with NXP tweeting Tuesday that its CEO Sievers met Prime Minister Modi to discuss strengthening the semiconductor ecosystem, developing STEM workforce and startup ecosystem in India. \"\nIndia is emerging as a key force in these sectors, powered by our talented youth, the Prime Minister said.\nPM Modi's meeting with NXP CEO gains significance as India is trying to develop its own semiconductor manufacturing ecosystem.\nNXP Semiconductors is a Dutch semiconductor designer and manufacturer.",
        "keywords": [
            "indias",
            "discusses",
            "met",
            "sievers",
            "semiconductor",
            "ecosystem",
            "semiconductors",
            "prime",
            "minister",
            "world",
            "strengthening",
            "modi",
            "meets",
            "nxp",
            "ceo"
        ],
        "sentiment": [
            "positive",
            1.0
        ],
        "dark": "False"
    },
    {
        "key": "9",
        "url": "https://news.google.com/articles/CBMiiwFodHRwczovL3d3dy5saXZlbWludC5jb20vbmV3cy9pbmRpYS9uYXJlbmRyYS1tb2RpLXMtbW9uZXktaXMtd2l0aC1hZGFuaS1jbS1hcnZpbmQta2Vqcml3YWwtdGFrZXMtYW5vdGhlci1qaWJlLWF0LXRoZS1wbS0xMTY4MDAwNzIxNTc4OC5odG1s0gGPAWh0dHBzOi8vd3d3LmxpdmVtaW50LmNvbS9uZXdzL2luZGlhL25hcmVuZHJhLW1vZGktcy1tb25leS1pcy13aXRoLWFkYW5pLWNtLWFydmluZC1rZWpyaXdhbC10YWtlcy1hbm90aGVyLWppYmUtYXQtdGhlLXBtL2FtcC0xMTY4MDAwNzIxNTc4OC5odG1s?hl=en-IN&gl=IN&ceid=IN%3Aen",
        "title": "CM Kejriwal alleges ‘PM Modi's money is with Adani’",
        "description": "The Delhi Assembly on Tuesday witnessed massive uproar when Arvind Kejriwal, Chief Minister of Delhi, claimed that a BJP leader had told him that all of Prime Minister Narendra Modi's money was with Adani, and that Modi wants to become the richest man in the world.\n\nSpeaking in the Assembly on Tuesday, Kejriwal alleged, \"PM is less educated and does not understand things properly. This is worrisome.\"\n\nKejriwal further alleged that Adani receives coal worth ₹2800 crore free every year. He also claimed that the Adani group's projects in Sri Lanka and Bangladesh have actually been taken up by Modi himself.\n\n\"There is rampant loot by the Centre. They have looted more in seven years than what the Congress had looted in 75 years. The country is passing through difficult times. We are deeply worried about the situation,\" he also charged.\n\nThe allegations led to an uproar in the House, with BJP MLAs demanding a discussion on alleged corruption in various departments of the Delhi government and calling for Kejriwal's resignation, as per a report by LiveHindustan.",
        "summary": "The Delhi Assembly on Tuesday witnessed massive uproar when Arvind Kejriwal, Chief Minister of Delhi, claimed that a BJP leader had told him that all of Prime Minister Narendra Modi's money was with Adani, and that Modi wants to become the richest man in the world.\nSpeaking in the Assembly on Tuesday, Kejriwal alleged, \"PM is less educated and does not understand things properly.\nKejriwal further alleged that Adani receives coal worth ₹2800 crore free every year.\nHe also claimed that the Adani group's projects in Sri Lanka and Bangladesh have actually been taken up by Modi himself.\nThey have looted more in seven years than what the Congress had looted in 75 years.",
        "keywords": [
            "alleges",
            "modis",
            "money",
            "delhi",
            "uproar",
            "bjp",
            "minister",
            "adani",
            "alleged",
            "cm",
            "claimed",
            "modi",
            "looted",
            "kejriwal"
        ],
        "sentiment": [
            "positive",
            1.0
        ],
        "dark": "False"
    }
]