[
    {
        "key": "0",
        "url": "https://news.google.com/stories/CAAqNggKIjBDQklTSGpvSmMzUnZjbmt0TXpZd1NoRUtEd2o5aWEtQUJ4RW5YWHczeVUtbjBDZ0FQAQ?hl=en-IN&gl=IN&ceid=IN%3Aen",
        "title": "NCLAT upholds fine imposed on Google by CCI",
        "description": "",
        "summary": "",
        "keywords": [
            "cci",
            "imposed",
            "upholds",
            "fine",
            "google",
            "nclat"
        ],
        "sentiment": [
            0.0,
            0.0
        ],
        "dark": "False"
    },
    {
        "key": "1",
        "url": "https://news.google.com/articles/CBMiPGh0dHBzOi8vOXRvNWdvb2dsZS5jb20vMjAyMy8wMy8yOS9nb29nbGUtdm9pY2UtbWF0ZXJpYWwteW91L9IBAA?hl=en-IN&gl=IN&ceid=IN%3Aen",
        "title": "Google Voice finally gets Material You redesign on Android",
        "description": "While Voice is not a Google Workspace app, it’s sold as an “add-on” to the suite and managed by that team. Google Voice for Android is now getting a Material You redesign.\n\nThis redesign starts with a tall Material You bottom bar that uses pill-shaped indicators to note your current tab. The FAB (floating action button) has changed from a circle into a rounded square. It does not disappear as you scroll.\n\nAt the top of the screen is a pill-shaped “Search Google Voice” field, while the navigation drawer has been modernized with rounded top and bottom corners, as well as a wider panel.\n\nDynamic Color is leveraged through the app, replacing the dull gray from before. When you’re viewing a conversation, the status and app bars are not merged.\n\nThe homescreen widgets also get a Material You treatment with a Dynamic Color background and modernized shapes.\n\nThis Voice update follows Google Tasks getting modernized in February. In terms of Android Workspace apps, Gmail, Calendar, Drive, Docs, Sheets, Slides, Meet, and Chat have all been updated. Jamboard is now the only Workspace-adjacent app without a revamp. On the web, Material You is available for Gmail, Drive, and Docs/Sheets/Slides.\n\nVersion 2023.03.20.518941070 of Google Voice for Android rolls out the Material You redesign. It’s not widely rolled out yet via the Play Store.\n\nMore on Google Voice:",
        "summary": "While Voice is not a Google Workspace app, it’s sold as an “add-on” to the suite and managed by that team.\nGoogle Voice for Android is now getting a Material You redesign.\nIn terms of Android Workspace apps, Gmail, Calendar, Drive, Docs, Sheets, Slides, Meet, and Chat have all been updated.\nVersion 2023.03.20.518941070 of Google Voice for Android rolls out the Material You redesign.\nMore on Google Voice:",
        "keywords": [
            "gets",
            "finally",
            "material",
            "workspace",
            "pillshaped",
            "app",
            "rounded",
            "redesign",
            "android",
            "google",
            "modernized",
            "voice"
        ],
        "sentiment": [
            0.08776041666666667,
            0.2375
        ],
        "dark": "False"
    },
    {
        "key": "2",
        "url": "https://news.google.com/stories/CAAqNggKIjBDQklTSGpvSmMzUnZjbmt0TXpZd1NoRUtEd2lFb3VtQkJ4Rmo5S05oam83M3p5Z0FQAQ?hl=en-IN&gl=IN&ceid=IN%3Aen",
        "title": "",
        "description": "",
        "summary": "",
        "keywords": [],
        "sentiment": [
            0.0,
            0.0
        ],
        "dark": "False"
    },
    {
        "key": "3",
        "url": "https://news.google.com/stories/CAAqNggKIjBDQklTSGpvSmMzUnZjbmt0TXpZd1NoRUtEd2oycE9xQ0J4RnZTVW8ySGl6QmxpZ0FQAQ?hl=en-IN&gl=IN&ceid=IN%3Aen",
        "title": "",
        "description": "",
        "summary": "",
        "keywords": [],
        "sentiment": [
            0.0,
            0.0
        ],
        "dark": "False"
    },
    {
        "key": "4",
        "url": "https://news.google.com/articles/CBMibmh0dHBzOi8vd3d3LnRoZXZlcmdlLmNvbS8yMDIzLzMvMjgvMjM2NjA2NTMvZ29vZ2xlLXNlYXJjaC1yZXN1bHRzLXBlcnNwZWN0aXZlcy1jYXJvdXNlbC1hYm91dC10aGlzLXBhZ2UtYXV0aG9y0gEA?hl=en-IN&gl=IN&ceid=IN%3Aen",
        "title": "Google is going to show a new ‘Perspectives’ carousel in search results",
        "description": "Google is adding a new carousel in search results to help you see different perspectives on certain search topics. The feature, called “Perspectives,” is a new box showing “insights from a range of journalists, experts, and other relevant voices” that will appear under the “Top Stories” box in results.\n\nIn a blog post, the company shared a GIF of what the box looks like for perspectives on this year’s Oscars. It includes tweets from Mark Hamill and Jamie Lee Curtis as well as a few articles. It looks fine, but I’m annoyed that it will be yet another thing cluttering up Google’s search results. (I may just be nostalgic for the good old days.)\n\nGIF: Google\n\nThe perspectives, in this instance, are fairly inoffensive. But it’s not difficult to imagine how this could surface the types of controversial opinions or inaccurate statements that we’re already subject to every day on Twitter. Google says it’s “committed to bringing you authoritative and trustworthy information” in the box, and here’s what spokesperson Meghann Farnsworth said about how it decides what will be included:\n\nOur systems automatically identify relevant voices across various platforms, depending on the search query. These systems look at a range of signals to determine if a result will be helpful, including relevance to the story, prominence, language, freshness, expertise and trustworthiness for the topic at hand. As with Search and News as a whole, we design our systems to surface high-quality, reliable information in the Perspectives carousel. When we become aware that content may violate our policies we review it and remove it from Search features where appropriate.\n\nYou’ll start seeing the Perspectives carousel “soon” in English in the US on desktop and mobile, according to Google. The company is adding a few other updates to search as well. The “About this result” box you can see when you click the three dots next to a link will get an “About this author” section. And that “About this result” box will be expanded to “all languages where Search is available” in the coming days.",
        "summary": "Google is adding a new carousel in search results to help you see different perspectives on certain search topics.\nIt looks fine, but I’m annoyed that it will be yet another thing cluttering up Google’s search results.\nAs with Search and News as a whole, we design our systems to surface high-quality, reliable information in the Perspectives carousel.\nYou’ll start seeing the Perspectives carousel “soon” in English in the US on desktop and mobile, according to Google.\nAnd that “About this result” box will be expanded to “all languages where Search is available” in the coming days.",
        "keywords": [
            "voices",
            "results",
            "going",
            "perspectives",
            "surface",
            "systems",
            "carousel",
            "box",
            "google",
            "result",
            "search"
        ],
        "sentiment": [
            0.13812511273448774,
            0.39310346771284277
        ],
        "dark": "False"
    },
    {
        "key": "5",
        "url": "https://news.google.com/articles/CBMiaWh0dHBzOi8vdGVjaC5oaW5kdXN0YW50aW1lcy5jb20vdGVjaC9uZXdzL2V1LXJlZ3VsYXRvcnMtY2xlYXItZ29vZ2xlLXMtbWF0aHMtYXBwLWRlYWwtNzE2ODAwMjU3OTM3NTQuaHRtbNIBbWh0dHBzOi8vdGVjaC5oaW5kdXN0YW50aW1lcy5jb20vYW1wL3RlY2gvbmV3cy9ldS1yZWd1bGF0b3JzLWNsZWFyLWdvb2dsZS1zLW1hdGhzLWFwcC1kZWFsLTcxNjgwMDI1NzkzNzU0Lmh0bWw?hl=en-IN&gl=IN&ceid=IN%3Aen",
        "title": "EU regulators clear Google's maths app deal",
        "description": "EU antitrust regulators gave unconditional approval for Alphabet unit Google's acquisition of Croatian maths app Photomath, the European Commission said in a statement on Tuesday.\n\nThe EU Commission said the deal would not reduce competition in the markets for \"online homework and study help tools that include maths as a subject offering and general search services,\" it said in a statement.\n\nReuters exclusively reported last week that Google was poised to win unconditional clearance for the deal.\n\nGoogle entered an agreement to acquire Photomath in May last year. Investors in the Croatian company include Menlo Ventures, LearnCapital, Goodwater Capital, GSV Ventures and Cherubic.",
        "summary": "EU antitrust regulators gave unconditional approval for Alphabet unit Google's acquisition of Croatian maths app Photomath, the European Commission said in a statement on Tuesday.\nThe EU Commission said the deal would not reduce competition in the markets for \"online homework and study help tools that include maths as a subject offering and general search services,\" it said in a statement.\nReuters exclusively reported last week that Google was poised to win unconditional clearance for the deal.\nGoogle entered an agreement to acquire Photomath in May last year.\nInvestors in the Croatian company include Menlo Ventures, LearnCapital, Goodwater Capital, GSV Ventures and Cherubic.",
        "keywords": [
            "croatian",
            "regulators",
            "photomath",
            "win",
            "app",
            "deal",
            "eu",
            "googles",
            "unconditional",
            "ventures",
            "commission",
            "clear",
            "week",
            "include",
            "maths"
        ],
        "sentiment": [
            0.06833333333333333,
            0.1433333333333333
        ],
        "dark": "False"
    },
    {
        "key": "6",
        "url": "https://news.google.com/articles/CBMiQ2h0dHBzOi8vd3d3LmFuZHJvaWRwb2xpY2UuY29tL2dvb2dsZS1wYXktcmVicmFuZGVkLXRvLXdhbGxldC1qYXBhbi_SAQA?hl=en-IN&gl=IN&ceid=IN%3Aen",
        "title": "",
        "description": "",
        "summary": "",
        "keywords": [],
        "sentiment": [
            0.0,
            0.0
        ],
        "dark": "False"
    },
    {
        "key": "7",
        "url": "https://news.google.com/articles/CBMiTGh0dHBzOi8vd3d3LnhkYS1kZXZlbG9wZXJzLmNvbS9nb29nbGUtbWFnaWMtZXJhc2VyLXZzLXNhbXN1bmctb2JqZWN0LWVyYXNlci_SAQA?hl=en-IN&gl=IN&ceid=IN%3Aen",
        "title": "",
        "description": "",
        "summary": "",
        "keywords": [],
        "sentiment": [
            0.0,
            0.0
        ],
        "dark": "False"
    },
    {
        "key": "8",
        "url": "https://news.google.com/articles/CBMiggFodHRwczovL3d3dy5saXZlbWludC5jb20vdGVjaG5vbG9neS90ZWNoLW5ld3MvYm9vc3QtZ29vZ2xlLWNocm9tZS1zLXBlcmZvcm1hbmNlLXVzaW5nLXRoaXMtbmV3LWRlc2t0b3AtZmVhdHVyZS0xMTY4MDA4MjgxMTAzNC5odG1s0gGGAWh0dHBzOi8vd3d3LmxpdmVtaW50LmNvbS90ZWNobm9sb2d5L3RlY2gtbmV3cy9ib29zdC1nb29nbGUtY2hyb21lLXMtcGVyZm9ybWFuY2UtdXNpbmctdGhpcy1uZXctZGVza3RvcC1mZWF0dXJlL2FtcC0xMTY4MDA4MjgxMTAzNC5odG1s?hl=en-IN&gl=IN&ceid=IN%3Aen",
        "title": "Boost Google Chrome’s performance using THIS new desktop feature",
        "description": "Google Chrome is one of the most popular web browsers used by millions worldwide. Google recently introduced Memory Saver mode that frees up memory from tabs you are not currently using. This, the tech company says, allows the active websites you’re browsing to deliver the ‘smoothest possible experience’.\n\nAll inactive tabs will be reloaded once you visit them again. Google Chrome’s Memory Saver mode feature is especially useful if you’re running other intensive applications, like editing family videos or playing games.\n\nWondering how to turn on the Memory Saver mode on Google Chrome?\n\nOpen Google Chrome on your laptop/desktop\n\nTap on the three-dot menu that is available next to your profile photo\n\nHere, click on Settings\n\nGo to Performance section\n\nNext, toggle on the Memory Saver mode\n\nReaders must note that the Memory Saver doesn’t disable media playing in the background. This means that users can still play music, YouTube videos and even podcasts in the background. The feature only disables websites that take resources without providing an immediate benefit.\n\nIn another news, Google has started opening access to its generative artificial intelligence (AI) chatbot called Bard as it seeks public feedback to “improve its systems\" and take on OpenAI’s ChatGPT. Bard can be accessed by users in the US and UK starting today at bard.google.com. It will be released in other regions and in other languages over time, the big tech firm said.\n\nBard was unveiled last month around the same time Microsoft announced AI-powered Bing, which is based on OpenAI's large language model that has been designed especially for search and is more powerful than even ChatGPT.\n\nGoogle’s Bing unveiling didn’t go as expected as the chatbot generated inaccurate information in a promotional video, which wiped out $100 billion in Google parent Alphabet’s market value.",
        "summary": "Google recently introduced Memory Saver mode that frees up memory from tabs you are not currently using.\nThis, the tech company says, allows the active websites you’re browsing to deliver the ‘smoothest possible experience’.\nGoogle Chrome’s Memory Saver mode feature is especially useful if you’re running other intensive applications, like editing family videos or playing games.\nWondering how to turn on the Memory Saver mode on Google Chrome?\nOpen Google Chrome on your laptop/desktopTap on the three-dot menu that is available next to your profile photoHere, click on SettingsGo to Performance sectionNext, toggle on the Memory Saver modeReaders must note that the Memory Saver doesn’t disable media playing in the background.",
        "keywords": [
            "chromes",
            "users",
            "desktop",
            "performance",
            "using",
            "tabs",
            "feature",
            "saver",
            "youre",
            "videos",
            "mode",
            "tech",
            "websites",
            "boost",
            "google",
            "memory"
        ],
        "sentiment": [
            0.03409863945578233,
            0.3645266439909297
        ],
        "dark": "False"
    },
    {
        "key": "9",
        "url": "https://news.google.com/articles/CBMiZGh0dHBzOi8vd3d3LnplZWJpei5jb20vdGVjaG5vbG9neS9hcHBzL25ld3MtZ29vZ2xlLXRvLXNodXQtamFjcXVhcmQtc21hcnQtZmFicmljLWFwcC1pbi1hcHJpbC0yMjgwNDbSAWhodHRwczovL3d3dy56ZWViaXouY29tL3RlY2hub2xvZ3kvYXBwcy9uZXdzLWdvb2dsZS10by1zaHV0LWphY3F1YXJkLXNtYXJ0LWZhYnJpYy1hcHAtaW4tYXByaWwtMjI4MDQ2L2FtcA?hl=en-IN&gl=IN&ceid=IN%3Aen",
        "title": "Google to shut Jacquard smart fabric app in April",
        "description": "Google has confirmed that it will be shutting down the app responsible for the Jacquard accessories made by the company's Advanced Technology and Projects (ATAP) group in April.\n\nJacquard, a full-scale digital technology platform created for smart apparel, footwear, and other everyday essentials, was unveiled by Google in 2015 and debuted two years later on special jackets from Levi's, reports 9to5Google.\n\nGoogle's Jacquard technology can embed touch sensors and haptic feedback into clothing, which can then be paired with a smartphone.\n\nIn effect, these smart jackets -- and later smart Yves Saint Laurent backpacks -- allowed users to perform specific (customisable) tasks on their phones without ever touching them.\n\nALSO READ | Bard Vs ChatGPT: How they differ from each other\n\nA double-tap, for example, could play/pause music, brushing the smart fabric could change tracks, and briefly covering the sensor would mute/unmute notifications, the report said.\n\nSeveral companies have released products that incorporate Google Jacquard since its initial release.\n\nLast year, Google shut down Duplex on the Web, a technology that enables Google Assistant to automate certain user tasks for site visitors.\n\nThe company introduced Duplex on the Web during its 2019 Google I/O developer conference.\n\nDuplex on the Web enables Google Assistant to perform different actions on the sites.",
        "summary": "Google's Jacquard technology can embed touch sensors and haptic feedback into clothing, which can then be paired with a smartphone.\nIn effect, these smart jackets -- and later smart Yves Saint Laurent backpacks -- allowed users to perform specific (customisable) tasks on their phones without ever touching them.\nSeveral companies have released products that incorporate Google Jacquard since its initial release.\nLast year, Google shut down Duplex on the Web, a technology that enables Google Assistant to automate certain user tasks for site visitors.\nDuplex on the Web enables Google Assistant to perform different actions on the sites.",
        "keywords": [
            "tasks",
            "perform",
            "smart",
            "technology",
            "jackets",
            "shut",
            "app",
            "web",
            "fabric",
            "enables",
            "google",
            "jacquard",
            "later"
        ],
        "sentiment": [
            0.05413727219282775,
            0.30179306290417407
        ],
        "dark": "False"
    }
]